Repository: CofficLab/Lumi
Catalog: Plugins/CADDesignerPlugin/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

# %@ · %@ g
source: %1$@ · %2$@ g
zh_hans: %@ · %@ 克
zh_hk: %@ · %@ 克

# %@ · %@ kg/m
source: %1$@ · %2$@ kg/m
zh_hans: %@ · %@ 千克/米
zh_hk: %@ · %@ 千克/米

# %lld · %@ kg
source: %1$lld · %2$@ kg
zh_hans: %lld · %@ 千克
zh_hk: %lld · %@ 千克

# %lld × %lldmm 原料 · 总利用率 %@
source: %1$lld × %2$lldmm 原料 · 总利用率 %3$@
zh_hans: %lld × %lldmm 原料 · 总利用率 %@
zh_hk: %lld × %lldmm 原料 · 总利用率 %@

source: %lld components
zh_hans: %lld 个组件
zh_hk: %lld 个组件

source: %lld mm
zh_hans: %lld 毫米
zh_hk: %lld 毫米

source: 3D Engine
zh_hans: 3D 引擎
zh_hk: 3D 引擎

source: 3D Viewport
zh_hans: 3D 视口
zh_hk: 3D 视口

source: Access European standard 20/30/40 series aluminum profiles (12 specifications) plus connectors: brackets, bolts, sliding nuts, end caps, and hinges.
zh_hans: 提供欧标 20/30/40 系列铝型材（12 种规格）以及连接件：支架、螺栓、滑块螺母、端盖与铰链。
zh_hk: 提供欧标 20/30/40 系列铝型材（12 种规格）以及连接件：支架、螺栓、滑块螺母、端盖与铰链。

source: AI-Powered Design
zh_hans: AI 智能设计
zh_hk: AI 智能设计

source: Assembly Relationships
zh_hans: 装配关系
zh_hk: 装配关系

source: Auto-generate rectangular frame
zh_hans: 自动生成矩形框架
zh_hk: 自动生成矩形框架

source: Automatically aggregate identical profiles and connectors into a bill of materials with quantities and specifications.
zh_hans: 自动将相同型材与连接件汇总为物料清单，包含数量与规格。
zh_hk: 自动将相同型材与连接件汇总为物料清单，包含数量与规格。

source: Available AI Tools
zh_hans: 可用的 AI 工具
zh_hk: 可用的 AI 工具

source: BOM Generation
zh_hans: 物料清单生成
zh_hk: 物料清单生成

source: Component Library
zh_hans: 组件库
zh_hk: 组件库

source: Create new CAD project
zh_hans: 创建新 CAD 项目
zh_hk: 创建新 CAD 项目

source: Cutting Optimization
zh_hans: 切割优化
zh_hk: 切割优化

source: Define connections
zh_hans: 定义连接关系
zh_hk: 定义连接关系

source: Define connections between components with rigid, hinge, or bolt joint types to build accurate assembly structures.
zh_hans: 通过刚性、铰链或螺栓等连接类型定义组件间关系，构建精确的装配结构。
zh_hk: 通过刚性、铰链或螺栓等连接类型定义组件间关系，构建精确的装配结构。

source: Design aluminum profile frames in an interactive 3D viewport with orbit camera, reference grid, and XYZ axis guides.
zh_hans: 在交互式 3D 视口中使用轨道相机、参考网格与 XYZ 坐标轴辅助线设计铝型材框架。
zh_hk: 在交互式 3D 视口中使用轨道相机、参考网格与 XYZ 坐标轴辅助线设计铝型材框架。

source: EU 20/30/40 series
zh_hans: 欧标 20/30/40 系列
zh_hk: 欧标 20/30/40 系列

source: Export Options
zh_hans: 导出选项
zh_hk: 导出选项

source: Export viewport renders as PNG or PDF. Save and load projects in .cadproj JSON format.
zh_hans: 将视口渲染导出为 PNG 或 PDF，并以 .cadproj JSON 格式保存与加载项目。
zh_hk: 将视口渲染导出为 PNG 或 PDF，并以 .cadproj JSON 格式保存与加载项目。

source: Generate bill of materials
zh_hans: 生成物料清单
zh_hk: 生成物料清单

source: Load project from file
zh_hans: 从文件加载项目
zh_hk: 从文件加载项目

source: macOS 14.0 or later
zh_hans: macOS 14.0 或更高版本
zh_hk: macOS 14.0 或更高版本

source: Natural language commands like 'build a 1m × 0.5m workbench' to automatically create frames with optimal component placement.
zh_hans: 通过自然语言指令（如“搭建一个 1m × 0.5m 的工作台”）自动生成框架并优化组件布局。
zh_hk: 通过自然语言指令（如“搭建一个 1m × 0.5m 的工作台”）自动生成框架并优化组件布局。

source: Optimize cutting plan
zh_hans: 优化切割方案
zh_hk: 优化切割方案

source: Optimize cutting plans using First Fit Decreasing algorithm to minimize material waste and leftover scraps.
zh_hans: 使用首次适应递减（First Fit Decreasing）算法优化切割方案，最大限度减少材料浪费与余料。
zh_hk: 使用首次适应递减（First Fit Decreasing）算法优化切割方案，最大限度减少材料浪费与余料。

source: Place aluminum profile
zh_hans: 放置铝型材
zh_hk: 放置铝型材

source: Place connector
zh_hans: 放置连接件
zh_hk: 放置连接件

source: Position
zh_hans: 位置
zh_hk: 位置

source: Profile Standards
zh_hans: 型材标准
zh_hk: 型材标准

source: profile: %@
zh_hans: 配置文件：%@
zh_hk: 配置文件：%@

source: Project Format
zh_hans: 项目格式
zh_hk: 项目格式

source: Requirements
zh_hans: 系统要求
zh_hk: 系统要求

source: Rotation
zh_hans: 旋转
zh_hk: 旋转

source: Save project to file
zh_hans: 将项目保存到文件
zh_hk: 将项目保存到文件

source: SceneKit (native macOS)
zh_hans: SceneKit（原生 macOS）
zh_hk: SceneKit（原生 macOS）

source: SceneKit-capable GPU
zh_hans: 支持 SceneKit 的 GPU
zh_hk: 支持 SceneKit 的 GPU

source: Swift 6.0 or later
zh_hans: Swift 6.0 或更高版本
zh_hk: Swift 6.0 或更高版本

source: Technical Details
zh_hans: 技术细节
zh_hk: 技术细节

source: UI Framework
zh_hans: UI 框架
zh_hk: UI 框架

source: Update component properties
zh_hans: 更新组件属性
zh_hk: 更新组件属性

# 原料 #%lld：余 %lldmm · 利用率 %@
source: 原料 #%1$lld：余 %2$lldmm · 利用率 %3$@
zh_hans: 原料 #%lld：余 %lldmm · 利用率 %@
zh_hk: 原料 #%lld：余 %lldmm · 利用率 %@

# 已选中：%@
source: Selected: %@
zh_hans: 已选中：%@
zh_hk: 已选中：%@

source: User Manual
zh_hans: 使用手册
zh_hk: 使用手冊

source: Overview
zh_hans: 概述
zh_hk: 概述

source: This manual covers the interface and basic operations of the CAD Designer: assembling profile frames, adjusting components, generating the bill of materials, and optimizing cuts.
zh_hans: 本手册介绍 CAD 设计的界面与基本操作:拼装型材框架、调整组件、生成物料清单以及切割优化。
zh_hk: 本手冊介紹 CAD 設計的介面與基本操作:組裝型材框架、調整組件、產生物料清單以及切割最佳化。

source: Interface
zh_hans: 界面说明
zh_hk: 介面說明

source: Toolbar: provides New Project, Undo, Redo, Save, Load, and Export PNG.
zh_hans: 「工具栏」:提供「新建项目」「撤销」「重做」「保存」「加载」与「导出 PNG」。
zh_hk: 「工具列」:提供「新增專案」「還原」「重做」「儲存」「載入」與「匯出 PNG」。

source: Component library: the left pane groups profiles by series and lists connectors; use the search field to filter, and click + to add a component.
zh_hans: 「组件库」:左侧面板按系列分组显示型材并列出连接件;可用搜索框筛选,点击「+」添加组件。
zh_hk: 「組件庫」:左側面板按系列分組顯示型材並列出連接件;可用搜尋欄篩選,點擊「+」新增組件。

source: Viewport: the center area previews the design in 3D; when empty, it prompts you to add a profile.
zh_hans: 「视口」:中央区域以三维方式预览设计;为空时会提示先添加型材。
zh_hk: 「視埠」:中央區域以三維方式預覽設計;為空時會提示先新增型材。

source: Inspector: the right pane edits the selected component's length, position, and rotation, and provides Delete and Measure.
zh_hans: 「属性面板」:右侧面板编辑所选组件的长度、位置与旋转,并提供「删除」「测量」。
zh_hk: 「屬性面板」:右側面板編輯所選組件的長度、位置與旋轉,並提供「刪除」「測量」。

source: Bottom area: the bill of materials table, plus cut optimization with a stock length field and the Optimize button.
zh_hans: 「底部区域」:物料清单表格,以及带「库存长度」输入框与「优化」按钮的切割优化。
zh_hk: 「底部區域」:物料清單表格,以及帶「庫存長度」輸入欄與「最佳化」按鈕的切割最佳化。

source: Figure 1: Interface layout
zh_hans: 图 1 界面布局
zh_hk: 圖 1 介面佈局

source: Toolbar
zh_hans: 工具栏
zh_hk: 工具列

source: Viewport
zh_hans: 视口
zh_hk: 視埠

source: Basic Operations
zh_hans: 基本操作
zh_hk: 基本操作

source: Create a new project with New Project, or load an existing one with Load.
zh_hans: 使用「新建项目」创建新项目,或使用「加载」打开已有项目。
zh_hk: 使用「新增專案」建立新專案,或使用「載入」開啟既有專案。

source: Click + on a profile in the component library to add it to the viewport.
zh_hans: 点击组件库中型材上的「+」,将其添加到视口。
zh_hk: 點擊組件庫中型材上的「+」,將其新增到視埠。

source: Select a component and adjust its length, position, and rotation in the inspector.
zh_hans: 选中某个组件,在属性面板中调整其长度、位置与旋转。
zh_hk: 選取某個組件,在屬性面板中調整其長度、位置與旋轉。

source: Add connectors from the component library to assemble the frame.
zh_hans: 从组件库添加连接件,将框架组装起来。
zh_hk: 從組件庫新增連接件,將框架組裝起來。

source: Review the bill of materials at the bottom of the workspace.
zh_hans: 在工作区底部查看物料清单。
zh_hk: 在工作區底部查看物料清單。

source: Enter the stock length and click Optimize to plan the cuts.
zh_hans: 输入库存长度,点击「优化」生成切割方案。
zh_hk: 輸入庫存長度,點擊「最佳化」產生切割方案。

source: Click Export PNG to export an image of the design.
zh_hans: 点击「导出 PNG」导出设计图片。
zh_hk: 點擊「匯出 PNG」匯出設計圖片。

source: AI Operations
zh_hans: AI 可执行的操作
zh_hk: AI 可執行的操作

source: Design complete profile frames from a description.
zh_hans: 根据文字描述设计完整的型材框架。
zh_hk: 依文字描述設計完整的型材框架。

source: Generate and update the bill of materials for the current design.
zh_hans: 为当前设计生成并更新物料清单。
zh_hk: 為當前設計產生並更新物料清單。

source: Notes
zh_hans: 注意事项
zh_hk: 注意事項

source: Save the project before closing to keep your changes.
zh_hans: 关闭前请先保存项目,以免丢失修改。
zh_hk: 關閉前請先儲存專案,以免遺失修改。

source: Review the bill of materials after editing components; quantities follow the current design.
zh_hans: 编辑组件后请核对物料清单;数量随当前设计变化。
zh_hk: 編輯組件後請核對物料清單;數量隨當前設計變化。

source: Cut optimization depends on the entered stock length; verify the result before cutting.
zh_hans: 切割优化结果取决于输入的库存长度;下料前请先核对方案。
zh_hk: 切割最佳化結果取決於輸入的庫存長度;下料前請先核對方案。

source: Add a profile from the component library to start.
zh_hans: 从组件库添加型材开始设计。

source: Bill of Materials
zh_hans: 物料清单

source: CAD Designer
zh_hans: CAD 设计

source: Components
zh_hans: 组件

source: Connectors
zh_hans: 连接件

source: Cut Optimization
zh_hans: 切割优化

source: Delete
zh_hans: 删除

source: Description
zh_hans: 描述

source: Design aluminum profile frames with 3D preview, BOM, and cut optimization.
zh_hans: 通过 3D 预览、物料清单与切割优化设计铝型材框架。

source: Empty viewport
zh_hans: 空视口

source: Export PNG
zh_hans: 导出 PNG

source: Inspector
zh_hans: 属性

source: Length
zh_hans: 长度

source: Load
zh_hans: 加载

source: Material
zh_hans: 材质

source: Measure
zh_hans: 测量

source: New Project
zh_hans: 新建项目

source: No components
zh_hans: 暂无组件

source: Optimize
zh_hans: 优化

source: Part Number
zh_hans: 零件号

source: Position X
zh_hans: 位置 X

source: Position Y
zh_hans: 位置 Y

source: Position Z
zh_hans: 位置 Z

source: Profiles
zh_hans: 型材

source: Quantity
zh_hans: 数量

source: Redo
zh_hans: 重做

source: Reset View
zh_hans: 重置视图

source: Rotation Y
zh_hans: 旋转 Y

source: Save
zh_hans: 保存

source: Search components
zh_hans: 搜索组件

source: Select
zh_hans: 选择

source: Select a component to edit it.
zh_hans: 选择组件进行编辑。

source: Stock Length
zh_hans: 原料长度

source: Undo
zh_hans: 撤销

source: Untitled Project
zh_hans: 未命名项目

source: Weight
zh_hans: 重量
